name = input('Здравствуйте! Как Вас зовут? ')
print(f'Очень приятно, {name}! Меня зовут Марк.')
age = int(input('Сколько Вам лет? '))
if age < 78:
    print(f'Да, {name}, я старше Вас на {78-age} лет.')
elif age > 78:
    print(f'Да, {name}, Вы старше меня на {age-78} лет.')
else:
    print(f'Да, {name}, Мы с вами одного возраста.')
ans = input('Вам нравится программировать? ')
if ans == 'да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.')